performance/tests/requisition.yml
execution:
  - concurrency: 10
    iterations: 10
    scenario: requisition-workflow
  - concurrency: 150
    ramp-up: 10m
    hold-for: 50m
    scenario: requisition-workflow
  - concurrency: 10
    iterations: 10
    scenario: requisition-workflow
  - concurrency: 10
    iterations: 10
    scenario: search-one-page
  - concurrency: 10
    iterations: 10
    scenario: get-requisitions-for-approval
  - concurrency: 10
    iterations: 10
    scenario: get-requisitions-for-convert

scenarios:
  get-period-for-initiate:
    requests:
      - url: ${__P(base-uri)}/api/requisitions/periodsForInitiate?programId=${program_id}&facilityId=${facility_id}&emergency=${emergency}
        method: GET
        label: GetPeriodsForInitiate
        headers:
          Authorization: Bearer ${access_token}
        extract-jsonpath:
          periods_count:
            jsonpath: $.size()
          period_id:
            jsonpath: $.[:1]id
        jsr223:
          script-text: |
            def count = vars.get("periods_count");
            if (count.toInteger() > 0) {
              def uuid = vars.get("period_id");
              uuid = uuid.replaceAll(/"|\[|\]/, "");
              vars.put("period_id", uuid);
            }
      - if: '${periods_count} == 0'
        then:
          - url: ${__P(base-uri)}/api/processingPeriods/?processingScheduleId=${schedule_id}
            method: GET
            label: GetPeriodsByScheduleId
            headers:
              Authorization: Bearer ${access_token}
            jsr223:
              script-text: |
                import groovy.json.JsonSlurper;
                import groovy.json.JsonOutput;
                import java.text.SimpleDateFormat;
                import java.util.Locale;
                import java.util.UUID;
                import java.util.Random;
                def dateFormat = "yyyy-MM-dd";
                def random = new Random();
                def response = prev.getResponseDataAsString();
                def jsonSlurper = new JsonSlurper();
                def periods = jsonSlurper.parseText(response);
                def last = periods.last();
                def endDate = new SimpleDateFormat(dateFormat, Locale.ENGLISH).parse(last.endDate);
                def periodDuration = last.durationInMonths * 30;
                def newStartDate = endDate + 1;
                def newEndDate = newStartDate + periodDuration;
                last.id = UUID.randomUUID().toString();
                last.startDate = newStartDate.format(dateFormat);
                last.endDate = newEndDate.format(dateFormat);
                last.name = last.name + (random.nextInt(1000000) + 1);
                vars.put("new_period_id", last.id);
                vars.put("new_period", JsonOutput.toJson(last));
          - url: ${__P(base-uri)}/api/processingPeriods/${new_period_id}
            method: PUT
            label: CreateProcessingPeriod
            headers:
              Authorization: Bearer ${access_token}
              Content-Type: application/json
            body: ${new_period}
            extract-jsonpath:
              period_id:
                jsonpath: $.id
            jsr223:
              script-text: |
                def uuid = vars.get("period_id");
                uuid = uuid.replaceAll(/"|\[|\]/, "");
                vars.put("period_id", uuid);
  initiate-requisition:
    requests:
      - url: ${__P(base-uri)}/api/requisitions/initiate?program=${program_id}&facility=${facility_id}&suggestedPeriod=${period_id}&emergency=${emergency}
        method: POST
        label: InitiateRequisition
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
        extract-jsonpath:
          requisition_id:
            jsonpath: $.id
        jsr223:
          script-text: |
           def response = prev.getResponseDataAsString();
            String uuid = vars.get("requisition_id");
            uuid = uuid.replaceAll(/"|\[|\]/, "");
            vars.put("requisition_id", uuid);
  update-requisition:
    requests:
      - url: ${__P(base-uri)}/api/requisitions/${requisition_id}
        method: GET
        label: GetRequisitionToUpdate
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
        jsr223:
          script-text: |
            import groovy.json.JsonSlurper;
            import groovy.json.JsonOutput;
            def response = prev.getResponseDataAsString();
            def jsonSlurper = new JsonSlurper();
            def requisition = jsonSlurper.parseText(response);
            requisition.datePhysicalStockCountCompleted = new Date().format('yyyy-MM-dd');
            requisition.requisitionLineItems.eachWithIndex { line, index ->
              line.skipped = false;
              line.beginningBalance = (index + 1) * 10;
              line.totalConsumedQuantity = line.beginningBalance / 2;
              line.totalReceivedQuantity = line.beginningBalance / 5;
              line.requestedQuantity = line.beginningBalance * 2;
              line.requestedQuantityExplanation = "we need more";
              line.totalStockoutDays = 0;
            }
            vars.put("requisition", JsonOutput.toJson(requisition));
      - url: ${__P(base-uri)}/api/requisitions/${requisition_id}
        method: PUT
        label: UpdateRequisition
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
        body: ${requisition}
  submit-requisition:
    requests:
      - url: ${__P(base-uri)}/api/requisitions/${requisition_id}/submit
        method: POST
        label: SubmitRequisition
        headers:
          Authorization: Bearer ${access_token}
  authorize-requisition:
    requests:
      - url: ${__P(base-uri)}/api/requisitions/${requisition_id}/authorize
        method: POST
        label: AuthorizeRequisition
        headers:
          Authorization: Bearer ${access_token}
  reject-requisition:
    requests:
      - url: ${__P(base-uri)}/api/requisitions/${requisition_id}/reject
        method: PUT
        label: RejectRequisition
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  approve-requisition:
    requests:
      - url: ${__P(base-uri)}/api/requisitions/${requisition_id}/approve
        method: POST
        label: ApproveRequisition
        headers:
          Authorization: Bearer ${access_token}
        jsr223:
          script-text: |
            import groovy.json.JsonSlurper;
            def response = prev.getResponseDataAsString();
  get-supplying-depot:
    requests:
      - url: ${__P(base-uri)}/api/requisitions/requisitionsForConvert?programId=${program_id}&facilityId=${facility_id}
        method: GET
        label: GetSupplyingDepotForFacility
        headers:
          Authorization: Bearer ${access_token}
        jsr223:
          script-text: |
            import groovy.json.JsonSlurper;

            // Get the requisition ID from variables
            def requisitionId = vars.get("requisition_id");
            def response = prev.getResponseDataAsString();
            def jsonSlurper = new JsonSlurper();
            def page = jsonSlurper.parseText(response);

            // Log the response to verify what is returned
            log.info("Response from requisitionsForConvert: " + response);

            // Check if the requisition ID matches and extract supplying depots
            def found = page.content.find { elem ->
              return requisitionId.equals(elem.requisition.id);
            };

            if (found != null && found.supplyingDepots != null && !found.supplyingDepots.isEmpty()) {
              def depotId = found.supplyingDepots.first().id;
              log.info("Found supplying depot ID: " + depotId);
              
              // Create the convert form
              def form = "{\"createOrder\": true, \"requisitionsToRelease\": [{ \"requisitionId\": \"" + requisitionId + "\", \"supplyingDepotId\": \"" + depotId + "\"}]}";
              vars.put("convert_form", form);
            } else {
              log.error("No supplying depots found for requisition ID: " + requisitionId);
            }

  convert-to-order:
    requests:
      - url: ${__P(base-uri)}/api/requisitions/batchReleases
        method: POST
        label: ConvertRequisitionToOrder
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
        body: ${convert_form}
  delete-requisition:
    requests:
      - url: ${__P(base-uri)}/api/requisitions/${requisition_id}
        method: DELETE
        label: DeleteRequisition
        headers:
          Authorization: Bearer ${access_token}
  requisition-workflow:
    variables:
      # Family Planning
      program_id: dce17f2e-af3e-40ad-8e00-3496adef44c3
      schedule_id: 9c15bd6e-3f6b-4b91-b53a-36c199d35eac
      emergency: false
    think-time: ~45s
    requests:
      - include-scenario: get-user-token
      - include-scenario: get-period-for-initiate
      - include-scenario: initiate-requisition
      - include-scenario: delete-requisition
      - include-scenario: initiate-requisition
      - include-scenario: update-requisition
      - include-scenario: submit-requisition
      - include-scenario: authorize-requisition
      - include-scenario: reject-requisition
      - include-scenario: submit-requisition
      - include-scenario: authorize-requisition
      - include-scenario: approve-requisition
      - include-scenario: get-supplying-depot
      - include-scenario: convert-to-order
    data-sources: # list of external data sources
      - path: facilities.csv  # this is a full form
        delimiter: ','
        quoted: false
        encoding: "utf-8"
        loop: true
        variable-names: facility_id,facility_code
        random-order: false
  search-one-page:
    think-time: ~60s
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/requisitions/search?page=0&size=10
        method: GET
        label: GetAPageOfTenRequisitions
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  get-requisitions-for-approval:
    think-time: ~60s
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/requisitions/requisitionsForApproval?page=0&size=10
        method: GET
        label: GetAPageOfTenRequisitionsForApproval
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  get-requisitions-for-convert:
      think-time: ~60s
      requests:
        - include-scenario: get-user-token
        - url: ${__P(base-uri)}/api/requisitions/requisitionsForConvert?page=0&size=10
          method: GET
          label: GetAPageOfTenRequisitionsForConvert
          headers:
            Authorization: Bearer ${access_token}
            Content-Type: application/json

reporting:
  - module: passfail
    criteria:
      - 'p90<=5000ms, continue as passed, label=GetPeriodsForInitiate, title="Get Periods for Initiate is successful"'
      - 'p90>5000ms and p90<=7000ms, continue as passed, label=GetPeriodsForInitiate, title="Get Periods for Initiate needs improvement"'
      - 'p90>7000ms, continue as failed, label=GetPeriodsForInitiate, title="Get Periods for Initiate is too high"'

      - 'p90<=10000ms, continue as passed, label=InitiateRequisition, title="Initiate Requisition is successful"'
      - 'p90>10000ms and p90<=15000ms, continue as passed, label=InitiateRequisition, title="Initiate Requisition needs improvement"'
      - 'p90>15000ms, continue as failed, label=InitiateRequisition, title="Initiate Requisition is too high"'

      - 'p90<=3000ms, continue as passed, label=GetRequisitionToUpdate, title="Get Requisition to Update is successful"'
      - 'p90>3000ms and p90<=5000ms, continue as passed, label=GetRequisitionToUpdate, title="Get Requisition to Update needs improvement"'
      - 'p90>5000ms, continue as failed, label=GetRequisitionToUpdate, title="Get Requisition to Update is too high"'

      - 'p90<=2000ms, continue as passed, label=UpdateRequisition, title="Update Requisition is successful"'
      - 'p90>2000ms and p90<=3000ms, continue as passed, label=UpdateRequisition, title="Update Requisition needs improvement"'
      - 'p90>3000ms, continue as failed, label=UpdateRequisition, title="Update Requisition is too high"'

      - 'p90<=1500ms, continue as passed, label=SubmitRequisition, title="Submit Requisition is successful"'
      - 'p90>1500ms and p90<=2000ms, continue as passed, label=SubmitRequisition, title="Submit Requisition needs improvement"'
      - 'p90>2000ms, continue as failed, label=SubmitRequisition, title="Submit Requisition is too high"'

      - 'p90<=3000ms, continue as passed, label=AuthorizeRequisition, title="Authorize Requisition is successful"'
      - 'p90>3000ms and p90<=5000ms, continue as passed, label=AuthorizeRequisition, title="Authorize Requisition needs improvement"'
      - 'p90>5000ms, continue as failed, label=AuthorizeRequisition, title="Authorize Requisition is too high"'

      - 'p90<=7000ms, continue as passed, label=RejectRequisition, title="Reject Requisition is successful"'
      - 'p90>7000ms and p90<=10000ms, continue as passed, label=RejectRequisition, title="Reject Requisition needs improvement"'
      - 'p90>10000ms, continue as failed, label=RejectRequisition, title="Reject Requisition is too high"'

      - 'p90<=50000ms, continue as passed, label=ApproveRequisition, title="Approve Requisition is successful"'
      - 'p90>50000ms and p90<=70000ms, continue as passed, label=ApproveRequisition, title="Approve Requisition needs improvement"'
      - 'p90>70000ms, continue as failed, label=ApproveRequisition, title="Approve Requisition is too high"'

      - 'p90<=5000ms, continue as passed, label=GetSupplyingDepotForFacility, title="Get Supplying Depot is successful"'
      - 'p90>5000ms and p90<=8000ms, continue as passed, label=GetSupplyingDepotForFacility, title="Get Supplying Depot needs improvement"'
      - 'p90>8000ms, continue as failed, label=GetSupplyingDepotForFacility, title="Get Supplying Depot is too high"'

      - 'p90<=15000ms, continue as passed, label=ConvertRequisitionToOrder, title="Convert Requisition to Order is successful"'
      - 'p90>15000ms and p90<=20000ms, continue as passed, label=ConvertRequisitionToOrder, title="Convert Requisition to Order needs improvement"'
      - 'p90>20000ms, continue as failed, label=ConvertRequisitionToOrder, title="Convert Requisition to Order is too high"'

      - 'p90<=3000ms, continue as passed, label=DeleteRequisition, title="Delete Requisition is successful"'
      - 'p90>3000ms and p90<=5000ms, continue as passed, label=DeleteRequisition, title="Delete Requisition needs improvement"'
      - 'p90>5000ms, continue as failed, label=DeleteRequisition, title="Delete Requisition is too high"'